# Imports needed to complete this assignment

In [4]:
!pip install pandas

Requirement already satisfied: pandas in e:\anaconda\lib\site-packages (1.1.3)
Requirement already satisfied: pytz>=2017.2 in e:\anaconda\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in e:\anaconda\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in e:\anaconda\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in e:\anaconda\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [5]:
import pandas as pd

In [8]:
print(pd.__version__)

1.1.3

#Write code to load the alumni csv dataset into a Pandas DataFrame called 'alumni'.

In [26]:
alumni = pd.read_csv( "C://Users//user//Documents//jupyter assignments//Assignments//alumni.csv")
alumni

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"
...,...,...,...,...,...,...,...,...
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

#Question 2 : Understand the data set (5 Marks)
Use the following pandas commands to understand the data set: a) head, b) tail, c) dtypes, d) info, e) describe

#a) head

In [27]:
alumni.head(5)

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

#b) tail

In [28]:
alumni.tail(11)

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
77,2006,Female,Married,Standard Diploma,No,65000,11335,"$46,000"
78,2007,Male,Divorced,Standard Diploma,Yes,75000,11335,"$32,000"
79,2008,Female,Married,Standard Diploma,No,110000,11335,"$50,000"
80,2009,Female,Divorced,Standard Diploma,Yes,75000,11335,"$19,000"
81,2005,Female,Single,Standard Diploma,Yes,90000,12066,"$16,000"
82,2006,Male,Married,College Prep Diploma,No,65000,12066,"$37,000"
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

c) dtypes

In [32]:
alumni.dtypes('Salary')

TypeError: 'Series' object is not callable